<script lang="ts">
  import ExtLink from '$lib/components/ExtLink.svelte';
  import RingoBunTemp from './RingoBunTemp.svelte';
  const {} = $props();
</script>

<p>
  以下は、ざすろん氏により作成された
  <ExtLink href="https://zaslon.info/langcontents/1450/">りんごを食べたい58文</ExtLink>
  のヴェッセンズラン語による翻訳のリストである。
</p>
<p>なんか58文より多い気がするが気にしない。</p>

<RingoBunTemp
  data={[
    [
      '私はりんごを食べる。',
      'Iķ eet änn apbel.',
      'iķ は1人称単数の人称代名詞、eet は eatan「食べる」の1人称単数現在、änn は不定冠詞 an の男性対格形。',
    ],
    ['私はりんごを食べた。', 'Iķ eat änn apbel.', 'eat は eatan の1人称単数過去。'],
    [
      '彼はりんごを食べている。',
      'Hee iss änn abpel eatend.',
      'iss はväzan動詞(コピュラ、英語のbe動詞に相当するもの)の3人称単数現在。eatend は eatan の現在分詞。現在分詞 + väzan で「～している」の意味を表す。',
    ],
    [
      '彼女はりんごを食べ終わっている。',
      'Hew haðð änn apbel ģyeaten.',
      'haðð は hapban の3人称単数現在形。ģyeaten は eatan の過去分詞。hapban + 過去分詞で現在完了形を作り、「(すでに)～してしまった」等を意味する。',
    ],
    [
      '彼女はりんごを食べ終わっていた。',
      'Hew hädd änn apbel ģyeaten.',
      'hädd は hapban の3人称単数過去形。',
    ],
    ['私の妻はりんごを食べたことがある。', 'Mąi vaiv haðð änn apbel ģyeaten.', ''],
    [
      '私の妻はりんごを毎日食べる。',
      'Mąi vaiv ietð jalķdäģ änn apbel.',
      'jalķdäģ「毎日」。習慣を表す文章は通常現在形である。',
    ],
    ['私と私の妻は昨日りんごを食べた。', 'Mąi vaiv and iķ eatað jystrędäģ änn apbel.', ''],
    ['私と私の妻は6日前にりんごを食べた。', 'Mąi vaiv and iķ eatað six dagas agan änn apbel.', ''],
    ['彼らは明日りんごを食べる。', 'Huy villað tumorgenn änn apbel eatan.', ''],
    ['彼らは6日後にりんごを食べる。', 'Huy villað baft six dagum änn apbel eatan.', ''],
    [
      '彼女らは3日間りんごを食べている。(食事としてりんごだけを食べている)',
      'Huy sind ðrau dagas lang änlaiķ apblas eatend.',
      '',
    ],
    ['彼女らはりんごを5分間食べ続けている。(りんごを食べる所要時間に5分かかっている)', '', ''],
    ['彼女らはりんごを5分で食べ終えた。(5分かかって食べ、現在は食べ終わっている)', '', ''],
    ['彼は常にりんごを食べている。(四六時中ずっとりんごを食べている)', '', ''],
    [
      'りんごが3つある。',
      'Ðjar sind(licķað) ðrau apblas.',
      'ðjar + (väzan または licķan) + S (+ 場所を示す語句) で「Sが (～に) ある」という意味の文になる。 動詞はSの人称に合わせる。',
    ],
    ['りんご達がテーブルの上にある。', 'On ðan bjodd sind apblas.', ''],
    [
      '誰かがあのりんごを食べてしまった。(その結果、あのりんごは今はない)',
      'Natilķ haðð ðänn apbel ģyeaten.',
      '',
    ],
    ['誰かがこのりんごを食べそうだ。(推量)', 'Natilķ vill ðes apbel eatan.', ''],
    ['誰かがこのりんご、そのりんご、あのりんごを食べたそうだ。(伝聞)', '', ''],
    [
      'りんごがひとつもない。',
      'Ðjar ne’sind nänn apblas naght.',
      'ヴェッセンズラン語は否定呼応を行う言語である。否定の意味を持つ語を2つ以上つけても「否定の否定」にはならず、否定の強調になる。ne’sind は否定縮約動詞 n’äzan の3人称単数現在形。他に否定冠詞 nan の複数主格形 nänn と否定の副詞 naght が付いて否定が強調されている。',
    ],
    ['私はりんごを食べない。', 'Iķ eet änn apbel naght.', ''],
    [
      '私はりんごを食べられない。(りんごがないので状況的に食べられない)',
      'Iķ kan änn apbel naght eatan.',
      '',
    ],
    ['私はりんごを床に落とした。', '', ''],
    ['りんごが床に落ちた。', '', ''],
    ['りんごは食べられない。(りんごの性質として、可食でなくなった)', '', ''],
    ['私はりんごを食べたい。', '', ''],
    ['私はりんごを買いたい。', '', ''],
    ['このりんごは汚い。', '', ''],
    ['このりんごは綺麗ではない。', '', ''],
    ['あのりんごは食べられそうだ。', '', ''],
    ['あのりんごはまさに食べられようとしている。', '', ''],
    ['あのりんごは食べることが可能そうだ。', '', ''],
    ['あれはりんごではない。', 'Ðat n’iss an apbel naght.', ''],
    ['これはりんごではなくみかんだ。', '', ''],
    ['あなたはみかんを食べるか?', 'Ietst ðaw änn orangan?', ''],
    ['主語と動詞を入れ替えれば疑問文となる。', '', ''],
    ['はい、私はみかんを食べます。', '', ''],
    ['あなたはみかんを食べないのですか?', '', ''],
    ['ええ、私はみかんを食べません。', '', ''],
    ['あなたはみかんを食べたかった。ですよね?', '', ''],
    ['いいえ、私はみかんを食べたくはありません。', '', ''],
    ['あなたはりんごもみかんも食べないのですか?', '', ''],
    ['いや、私はりんごを食べます。', '', ''],
    ['私はみかんを食べない。だから、みかんは食べられない。(受け身の否定)', '', ''],
    ['りんごは食べることができない。なぜなら、りんごは綺麗ではないから。', '', ''],
    ['りんごは汚い。一方で、みかんは綺麗だ。', '', ''],
    ['みかんを食べましょうよ? (勧誘)', '', ''],
    ['いいえ、お断りします。', '', ''],
    ['あそこでみかんを食べろ。りんごは食べるな。', '', ''],
    ['りんごを頂いても宜しいですか? みかんは差し上げます。', '', ''],
    [
      '私は「りんごは食べるな、みかんを食べろ」と言った。',
      '»Eat nänn apbel naght, agh änn orangan,« quað iķ.',
      '引用文自体を第一要素と捉え、V2語順なので動詞 quað (quäðan「～と言う」の過去一人称単数形) が次に来る。',
    ],
    ['あなたはりんごを食べろと言うのですか?', '', ''],
    ['貴様はりんごを食べたいと言った。', '', ''],
    ['私はりんごを食べたいと言った覚えがない。', '', ''],
    ['あなたは確か「私はりんごを食べたい」と言ったはずだ。', '', ''],
    ['私はもしかしたらそう言ったかもしれない。', '', ''],
    ['あなたは絶対に私に対して「りんごを食べたい」と言った。', '', ''],
    ['彼は私にりんごを食べさせる。', '', ''],
    ['彼は私にりんごを食べるように命じた。', '', ''],
    ['彼が私にりんごを食べさせてくれた。', '', ''],
    ['みかんは私に食べられていない。', '', ''],
    ['りんごは彼によって私に食べさせられた。', '', ''],
    ['ここには何もない。', 'Nänn ne’sind naght.', ''],
  ]}
/>
