<script>
  import XSection from '$lib/components/XSection.svelte';
  import XTable from '$lib/components/XTable.svelte';
</script>

<XSection title="単独字の発音">
  <p>
    表記にはラテン文字を使用する。a–zの26文字に加え、いくつかのダイアクリティカルマークを用いる。
  </p>
  <p>
    備考に特に何も書かれていなければ、ローマ字通りの発音でOK。「発音例」の音声記号は、「音韻論」の項で詳しく説明している。
  </p>
  <XTable
    headRows={1}
    class="[&_:where(tbody_td:nth-child(3))]:font-ipa [&_:where(tbody_td:last-child)]:whitespace-normal"
    data={[
      ['大文字', '小文字', '発音例', '備考'],
      ['A', 'a', '/ä/, /ɑː/', ''],
      ['B', 'b', '/b/', ''],
      ['C', 'c', '/kʰ/, /ɕ/', ''],
      ['Ç', 'ç', '/ɕ/', 'セディール (sedil) 付きC。シャ行子音に近い'],
      ['D', 'd', '/d/', ''],
      ['E', 'e', '/ɛ/', '広めの「エ」'],
      ['É', 'é', '/e/', '狭めの「エ」'],
      ['F', 'f', '/f/', ''],
      ['G', 'g', '/ɡ/', ''],
      ['Ģ', 'ģ', '/j/', 'Gの上または下にコンマがつく。j と同じ'],
      ['H', 'h', '/ɦ/', ''],
      ['I', 'i', '/ɪ/, /iː/', ''],
      ['J', 'j', '/j/', 'ヤ行の子音'],
      ['K', 'k', '/kʰ/', '使用頻度は少なめ'],
      ['L', 'l', '/l/', ''],
      ['M', 'm', '/m/', ''],
      ['N', 'n', '/n/, /ŋ/', ''],
      ['O', 'o', '/ɔ/', ''],
      [
        'Ó',
        'ó',
        '/ʊ/, /uː/',
        '「オ」ではなく「ウ」に近い。日本語の「ウ」よりも奥の方で唇をすぼめて発音する',
      ],
      ['P', 'p', '/pʰ/', ''],
      [
        'Q',
        'q',
        '/k/',
        [
          '基本 <em>qu</em> のセットで使われ、<span class="font-ipa">/kʋ/</span> という音を表す',
          { rawHTML: true },
        ],
      ],
      ['R', 'r', '/ɽ/, /ɻ/', '日本語のラ行子音に近いが、より奥の方'],
      ['S', 's', '/s/', ''],
      ['T', 't', '/tʰ/', ''],
      [
        'U',
        'u',
        '/ʏ/, /yː/',
        '「ウ」の口の形のまま「イ」と発音する。独語の ü、仏語の u などに近い',
      ],
      ['V', 'v', '/ʋ/', '英語のvに近いが、やや摩擦が弱い'],
      ['W', 'w', '/ʊ̯/', '主に二重母音などに使われる'],
      ['X', 'x', '/ks/', ''],
      ['Y', 'y', '/ɪ/, /iː/', 'i と同じ'],
      ['Z', 'z', '/z/', ''],
      ['Œ', 'œ', '/œ/, /øː/', '「オ」の口の形のまま「エ」と発音する'],
    ]}
  />
</XSection>

<XSection title="重音字の発音">
  <p>
    いくつかの子音や母音は二文字以上の文字の組み合わせで表される。ここでは、そのようなものを<strong
      >重音字</strong
    >と呼んでいる。
  </p>
</XSection>

<XSection title="鼻母音の表記について">
  <p>
    基本は、「母音字 + <i>m</i>」or「母音字 +
    <i>n</i
    >」という綴りのとき、対応する鼻母音で読む。基本はそのままだが、下に示すように母音が変わるものもある。
  </p>
  <XTable
    headRows={1}
    class="[&_:where(tbody_td:last-child)]:font-ipa"
    data={[
      ['表記', '発音'],
      ['in, im, yn, ym', '/ẽː/'],
      ['un, um', '/ø̃ː/'],
      ['ón, óm', '/õː/'],
    ]}
  />
  <p>ただし、</p>
  <ul>
    <li><i>nd, nt, nk, ng, mb, mp</i> という綴りの場合</li>
    <li><i>m, n</i> の左右両隣が母音字である場合</li>
    <li><i>mm, nn</i> と二重に綴ってある場合</li>
  </ul>
  <p>
    は鼻母音にはならず、普通に <span class="font-ipa">/Vm/, /Vn/, /Vŋ/</span>（<span
      class="font-ipa">/V/</span
    >
    は任意の母音）などと読む。
  </p>
  <p>
    例. <i>lüvjan</i> <span class="font-ipa">/ˈlyːʋjɑ̃ː/</span>（「愛する」原形不定詞） vs.
    <i>tu lüvjenn</i> <span class="font-ipa">/tʊ ˈlyːʋjən/</span>（tu不定詞）
  </p>
  <p>
    また、母音字にオゴネク（“˛”
    U+0328）が付いた場合、同様に鼻母音で読む。母音の変わり方は上と同様である。 なお、<strong
      >重音字の母音は後ろに <i>m, n</i> が来ても、鼻母音にはならない。</strong
    >重音字の鼻母音は1番目の母音にオゴネクをつけて表す（「重音字の発音」の項で示したように。）
  </p>
</XSection>

<XSection title="その他事項">
  <p>
    ドイツ語などのように語末子音が無声化することはなく、文字通りに発音する。
    語形変化などによって有声子音の後に無声子音が来るときは、無声化する。
  </p>
  <p>
    例. <i>flewgan</i> <span class="font-ipa">/ˈflɪɔɡɑ̃ː/</span>（「飛ぶ」原形不定詞）→
    <i>fliagst</i>
    <span class="font-ipa">/flɪɐkst/</span>（直説法過去2人称単数）
  </p>
</XSection>

<h3 class="ctext-caution my-8 text-center">工事中...</h3>
