<script lang="ts">
	import ExtLink from '$lib/sfc/ext_link.svelte';
</script>

<svelte:head>
	<title>葦語 りんご文</title>
</svelte:head>

<h2 id="subtitle">りんごを食べたい58文</h2>
<p>
	以下は、ざすろん氏により作成された <ExtLink
		href="https://zaslon.info/langcontents/1450/"
		text="りんごを食べたい58文"
	/> のヴェッセンズラン語による翻訳のリストである。</p>

<p class="text-red-600 text-xl text-center">工事中……</p>

<ul class="[&_p]:mb-0 [&_li]:mb-4">
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
    <li>
        <p></p>
        <p></p>
        <p></p>
    </li>
</ul>
	
1. 私はりんごを食べる。
Iķ eet änn apbel.
説明：iķ は1人称単数の人称代名詞、eet は eatan「食べる」の1人称単数現在、änn は不定冠詞 an の男性対格形。

2. 私はりんごを食べた。
Iķ eat änn apbel. 
説明：eat は eatan の1人称単数過去。

3. 彼はりんごを食べている。
Hee iss änn abpel eatend. 
説明：iss はväzan動詞（コピュラ、英語のbe動詞に相当するもの）の3人称単数現在。eatend は eatan の現在分詞。現在分詞 + väzan で「～している」の意味を表す。

4. 彼女はりんごを食べ終わっている。
Hew haðð änn apbel ģyeaten. 
説明：haðð は hapban の3人称単数現在形。ģyeaten は eatan の過去分詞。hapban + 過去分詞で現在完了形を作り、「(すでに)～してしまった」等を意味する。

5. 彼女はりんごを食べ終わっていた。
Hew hädd änn apbel ģyeaten. 
説明：hädd は hapban の3人称単数過去形。

6. 私の妻はりんごを食べたことがある。
Mąi vaiv haðð änn apbel ģyeaten.

7. 私の妻はりんごを毎日食べる。
Mąi vaiv ietð jalķdäģ änn apbel. 
説明：jalķdäģ「毎日」。習慣を表す文章は通常現在形である。

8. 私と私の妻は昨日りんごを食べた。
Mąi vaiv and iķ eatað jystrędäģ änn apbel.

9. 私と私の妻は6日前にりんごを食べた。
Mąi vaiv and iķ eatað six dagas agan änn apbel.

10. 彼らは明日りんごを食べる。
Huy villað tumorgenn änn apbel eatan.

11. 彼らは6日後にりんごを食べる。
Huy villað baft six dagum änn apbel eatan.

12. 彼女らは3日間りんごを食べている。（食事としてりんごだけを食べている） Huy sind ðrau dagas lang änlaiķ apblas eatend.

13. 彼女らはりんごを5分間食べ続けている。（りんごを食べる所要時間に5分かかっている）

13-1. 彼女らはりんごを5分で食べ終えた。（5分かかって食べ、現在は食べ終わっている）

14. 彼は常にりんごを食べている。（四六時中ずっとりんごを食べている）

15. りんごが3つある。
Ðjar sind(licķað) ðrau apblas.
説明：ðjar + (väzan または licķan) + S (+ 場所を示す語句) で「Sが（～に）ある」という意味の文になる。

16. りんご達がテーブルの上にある。 On ðan bjodd sind apblas. 
説明：

17. 誰かがあのりんごを食べてしまった。（その結果、あのりんごは今はない）
Natilķ haðð ðänn apbel ģyeaten.

18. 誰かがこのりんごを食べそうだ。（推量）
Natilķ vill ðes apbel eatan.

19. 誰かがこのりんご、そのりんご、あのりんごを食べたそうだ。（伝聞）

20. りんごがひとつもない。
Ðjar ne’sind nänn apblas naght. 
説明：ヴェッセンズラン語は否定呼応を行う言語である。否定の意味を持つ語を2つ以上つけても「否定の否定」にはならず、否定の強調になる。ne’sind は否定縮約動詞 n’äzan の3人称単数現在形。他に否定冠詞 nan の複数主格形 nänn と否定の副詞 naght が付いて否定が強調されている。

21. 私はりんごを食べない。
Iķ eet änn apbel naght.

22. 私はりんごを食べられない。（りんごがないので状況的に食べられない）
Iķ kan änn apbel naght eatan.

23. 私はりんごを床に落とした。

24. りんごが床に落ちた。

25. りんごは食べられない。（りんごの性質として、可食でなくなった）

26. 私はりんごを食べたい。

27. 私はりんごを買いたい。

28. このりんごは汚い。

29. このりんごは綺麗ではない。

30. あのりんごは食べられそうだ。

30-1. あのりんごはまさに食べられようとしている。

30-2. あのりんごは食べることが可能そうだ。

31. あれはりんごではない。
Ðat n’iss an apbel naght.
説明：

32. これはりんごではなくみかんだ。

33. あなたはみかんを食べるか？
Ietst ðaw änn orangan?
説明：主語と動詞を入れ替えれば疑問文となる。

34. はい、私はみかんを食べます。

35. あなたはみかんを食べないのですか？

36. ええ、私はみかんを食べません。

37. あなたはみかんを食べたかった。ですよね？

38. いいえ、私はみかんを食べたくはありません。

39. あなたはりんごもみかんも食べないのですか？

40. いや、私はりんごを食べます。

41. 私はみかんを食べない。だから、みかんは食べられない。（受け身の否定）

42. りんごは食べることができない。なぜなら、りんごは綺麗ではないから。

43. りんごは汚い。一方で、みかんは綺麗だ。

44. みかんを食べましょうよ？（勧誘）

45. いいえ、お断りします。

46. あそこでみかんを食べろ。りんごは食べるな。

47. りんごを頂いても宜しいですか？みかんは差し上げます。

48. 私は「りんごは食べるな、みかんを食べろ」と言った。
»Eat nänn apbel naght, agh änn orangan,« quað iķ.
説明：引用文自体を第一要素と捉え、V2語順なので動詞 quað（quäðan「～と言う」の過去一人称単数形）が次に来る。

49. あなたはりんごを食べろと言うのですか？

50. 貴様はりんごを食べたいと言った。

51. 私はりんごを食べたいと言った覚えがない。

52.あなたは確か「私はりんごを食べたい」と言ったはずだ。

53. 私はもしかしたらそう言ったかもしれない。

54. あなたは絶対に私に対して「りんごを食べたい」と言った。

55. 彼は私にりんごを食べさせる。

55-1. 彼は私にりんごを食べるように命じた。

55-2. 彼が私にりんごを食べさせてくれた。

56. みかんは私に食べられていない。

57. りんごは彼によって私に食べさせられた。

58. ここには何もない。
Nänn ne’sind naght.
説明：

